# Додаткові завдання по матрицях (надіслати як завжди мені в лс після виконання основного дз):
#
# створити матрицю 10 на 10, заповнити рандомними значеннями від 10 до 99
#
# вивести на екран
#
# - вивести суму чисел головної діагоналі матриці
#
# - вивести мінімальне та максимальне значення побічної діагоналі матриці
#
# - ввести з клавіатури порядковий номер стовпця - вивести цифри з цього стовпця на екран (аналогічно зробити з рядком)
#
# - ввести з клавіатури порядковий номер одного стовпця і потім іншого стовпця і поміняти їх місцями в матрицю (аналогічно зробити з рядком)
#
from random import *

n = 10
a = [[0] * n for i in range(n)]
sum = 0
for i in range(n):
    for j in range(n):
        a [i] [j] = randint(10,99)
for i in range(n):
    for j in range(n):
        if i == j:
            sum += a[i][j]

for row in a:
    print(' '.join([str(elem) for elem in row]))
print (sum)

